tests/performance/artillery-config.yml
config:
  target: 'http://localhost:8080'  # À adapter selon votre environnement de test
  phases:
    # Phase 1: Test de montée en charge progressive
    - duration: 60  # 1 minute
      arrivalRate: 1  # 1 utilisateur par seconde
      name: "Montée en charge lente"
    # Phase 2: Charge normale
    - duration: 120  # 2 minutes
      arrivalRate: 5  # 5 utilisateurs par seconde
      name: "Charge normale"
    # Phase 3: Charge élevée
    - duration: 60  # 1 minute
      arrivalRate: 10  # 10 utilisateurs par seconde
      name: "Charge élevée"
    # Phase 4: Test de stress
    - duration: 30  # 30 secondes
      arrivalRate: 20  # 20 utilisateurs par seconde
      name: "Test de stress"
  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery-PDF-Test/1.0'

scenarios:
  # Scénario 1: Génération PDF simple
  - name: "Génération PDF Simple"
    weight: 40  # 40% des requêtes
    flow:
      - post:
          url: "/wp-admin/admin-ajax.php"
          headers:
            Content-Type: 'application/x-www-form-urlencoded'
          form:
            action: 'pdf_builder_generate_pdf'
            template_id: 'simple_invoice'
            order_id: '12345'
            security: 'test_nonce_123'
          capture:
            json: "$.success"
            as: "pdf_success"
      - think: 2  # Pause de 2 secondes
      - log: "PDF Simple généré: {{ pdf_success }}"

  # Scénario 2: Génération PDF avec données WooCommerce
  - name: "Génération PDF WooCommerce"
    weight: 35  # 35% des requêtes
    flow:
      - post:
          url: "/wp-admin/admin-ajax.php"
          headers:
            Content-Type: 'application/x-www-form-urlencoded'
          form:
            action: 'pdf_builder_generate_pdf'
            template_id: 'woocommerce_invoice'
            order_id: "{{ randomInt(10000, 99999) }}"
            customer_id: "{{ randomInt(1, 1000) }}"
            security: 'test_nonce_123'
          capture:
            json: "$.data.pdf_url"
            as: "pdf_url"
      - think: 3  # Pause de 3 secondes
      - get:
          url: "{{ pdf_url }}"
          expect:
            - statusCode: 200
      - log: "PDF WooCommerce généré: {{ pdf_url }}"

  # Scénario 3: Génération PDF complexe (avec fallback)
  - name: "Génération PDF Complexe"
    weight: 20  # 20% des requêtes
    flow:
      - post:
          url: "/wp-admin/admin-ajax.php"
          headers:
            Content-Type: 'application/x-www-form-urlencoded'
          form:
            action: 'pdf_builder_generate_pdf'
            template_id: 'complex_report'
            order_id: "{{ randomInt(10000, 99999) }}"
            include_images: 'true'
            include_charts: 'true'
            security: 'test_nonce_123'
          capture:
            json: "$.data.fallback_used"
            as: "fallback_used"
      - think: 5  # Pause de 5 secondes (PDF complexe prend plus de temps)
      - log: "PDF Complexe généré, Fallback: {{ fallback_used }}"

  # Scénario 4: Test de sécurité - Tentative d'injection
  - name: "Test Sécurité - Injection"
    weight: 5  # 5% des requêtes (tests de sécurité)
    flow:
      - post:
          url: "/wp-admin/admin-ajax.php"
          headers:
            Content-Type: 'application/x-www-form-urlencoded'
          form:
            action: 'pdf_builder_generate_pdf'
            template_id: '<script>alert("XSS")</script>'
            order_id: '../../../etc/passwd'
            security: 'test_nonce_123'
          expect:
            - statusCode: 400  # Devrait être rejeté
      - log: "Test sécurité: Tentative d'injection rejetée"